<!--
php.su
котеров, костарев php 5 в последнем подленнике издание 
-->

<?php 
$lenthRoad;  <!-- все переменные начинаются с символа $ , нет привязанности к типу данных, но есть регистр--> 
echo "вывод через echo";
$w = "world!";
ecgo "Hello".$w; <!-- конкатинация строк через точку -->
var_dump($w);
print_r($w);
if ($w =="world"){
	echo "yes";
}
else{
	echo "no";
};
?>  <!-- все, что заключено в данные символы является кодом php -->
<!-- для запуска php необходим интерпритатор 